zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/ke1xz/pinctrl/MKE17Z512VLH9-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MKE17Z512VLH9/signal_configuration.xml
 *
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MKE17Z512VLL9-pinctrl.h with this part's differences applied
 * below (98 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: efcbdbbe615b6e11
 */

#ifndef _ZEPHYR_DTS_BINDING_MKE17Z512VLH9_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MKE17Z512VLH9_WRAPPER_

#include "MKE17Z512VLL9-pinctrl.h"

/* Signals not present on this part */
#undef BUSOUT_PTA14
#undef CLKOUT_PTD14
#undef EWM_IN_PTA14
#undef EWM_OUT_b_PTA17
#undef FTM0_CH0_PTB10
#undef FTM0_CH1_PTB11
#undef FTM0_CH2_PTB14
#undef FTM0_CH3_PTB15
#undef FTM0_CH4_PTB16
#undef FTM0_CH5_PTB17
#undef FTM0_CH6_PTA17
#undef FTM0_CH7_PTD8
#undef FTM0_FLT0_PTA14
#undef FTM0_FLT1_PTE14
#undef FTM0_FLT2_PTD17
#undef FTM0_FLT3_PTE12
#undef FTM1_CH2_PTA15
#undef FTM1_CH3_PTA16
#undef FTM2_CH0_PTD10
#undef FTM2_CH1_PTD11
#undef FTM2_CH2_PTD12
#undef FXIO_D0_PTB10
#undef FXIO_D1_PTB11
#undef FXIO_D2_PTD9
#undef FXIO_D2_PTE15
#undef FXIO_D3_PTE16
#undef FXIO_D4_PTB8
#undef FXIO_D5_PTB9
#undef FXIO_D6_PTA8
#undef FXIO_D7_PTA9
#undef LPI2C0_HREQ_PTB11
#undef LPI2C0_SCLS_PTB9
#undef LPI2C0_SCL_PTB8
#undef LPI2C0_SDAS_PTB10
#undef LPI2C0_SDA_PTA16
#undef LPI2C1_HREQ_PTD12
#undef LPI2C1_SCL_PTD9
#undef LPI2C1_SDA_PTD8
#undef LPSPI0_PCS0_PTC13
#undef LPSPI0_PCS1_PTD8
#undef LPSPI0_PCS3_PTA15
#undef LPSPI0_SCK_PTC10
#undef LPSPI0_SIN_PTC11
#undef LPSPI0_SOUT_PTC12
#undef LPSPI1_PCS2_PTA16
#undef LPSPI1_PCS3_PTB17
#undef LPSPI1_SCK_PTB14
#undef LPSPI1_SIN_PTB15
#undef LPSPI1_SOUT_PTB16
#undef LPUART1_RX_PTD13
#undef LPUART1_TX_PTD14
#undef LPUART2_CTS_PTD11
#undef LPUART2_RTS_PTD12
#undef LPUART2_RX_PTD17
#undef LPUART2_TX_PTE12
#undef PTA14
#undef PTA15
#undef PTA16
#undef PTA17
#undef PTA8
#undef PTA9
#undef PTB10
#undef PTB11
#undef PTB14
#undef PTB15
#undef PTB16
#undef PTB17
#undef PTB8
#undef PTB9
#undef PTC10
#undef PTC11
#undef PTC12
#undef PTC13
#undef PTD10
#undef PTD11
#undef PTD12
#undef PTD13
#undef PTD14
#undef PTD17
#undef PTD8
#undef PTD9
#undef PTE12
#undef PTE13
#undef PTE14
#undef PTE15
#undef PTE16
#undef RTC_CLKOUT_PTD13
#undef TRGMUX_OUT0_PTA8
#undef TRGMUX_OUT1_PTA9
#undef TRGMUX_OUT2_PTD17
#undef TRGMUX_OUT3_PTE12
#undef TRGMUX_OUT4_PTE14
#undef TRGMUX_OUT5_PTE13
#undef TRGMUX_OUT6_PTE15
#undef TRGMUX_OUT7_PTE16
#undef TSI0_CH13_PTE16
#undef TSI0_CH14_PTE15
#undef TSI0_CH15_PTE13

#endif /* _ZEPHYR_DTS_BINDING_MKE17Z512VLH9_WRAPPER_ */
